Repository: nodecode/wp-minify-fix
Catalog: lang/wp-minify-*.po
Languages: ar, it_it, uk

source: You are using WordPress version %s.
ar: أنت تستعمل نسخة الووردبريس %s.
it_it: Stai utilizzando la versione %s di WordPress.
uk: Ви використовуєте WordPress версії %s.

source: %s recommends that you use WordPress %s or newer.
ar: %s ينصح باستخدام إصدار الووردبريس رقم %s أو أحدث.
it_it: %s si raccomanda l'utilizzo di WordPress %s o superiore.
uk: %s рекомендує використовувати WordPress %s або більш пізньої версії.

source: %sPlease update!%s
ar: %sرجاء قم بالتحديث!%s
it_it: %sAggiorna!%s
uk: %sБудь ласка, оновіть!%s

source: %s options has been updated.
ar: تم تحديث إعدادات %s.
it_it: %s le opzioni sono state aggiornate.
uk: Опції %s оновлено

source: %s options has been upgraded.
ar: تم تحديث إعدادات %s.
it_it: %s le opzioni sono state aggiornate alla superiore.
uk: Опції %s оновлено.

source: %s options has been reset.
ar: تم تصفير إعدادات %s.
it_it: %s le opzioni sono state ripristinate.
uk: Опції %s скинуто.

source: %s cache has been cleared.
ar: تم نظيف النسخة المخزنة لـ %s.
it_it: %s la cache é stata svuotata.
uk: Кеш %s очищено.

source: %s options imported.
ar: تم استيراد إعدادات %s
it_it: %s le opzioni sono state importate.
uk: Опції %s імпортовано.

source: %s options import failed!
ar: لقد فشل استيراد إعدادات %s
it_it: %s la importazione delle opzioni é fallita!
uk: Імпортування опції %s невдале!

source: Did not receive any file to be imported. %s options import failed!
ar: لم يتم استقبال أي ملف ليتم استيراده، لذلك فشل استيراد إعدادات %s!
it_it: Non é stato ricevuto alcun file che possa essere importato. %s l'importazione delle opzioni é fallita!
uk: Неможливо отримати доступ до файлу. %s опції імпортувати не вдалося!

source: Found syntax errors in file being imported. %s options import failed!
ar: تم العثور على أخطاء في الملف المستورد، لذلك فشل استيراد إعدادات %s!
it_it: E' stato riscontrato un errore di sintassi nel file di importazione. %s l'importazione delle opzioni non é avvenuta!
uk: Знайдено синтаксичні помилки у файлі імпорту. %s параметри імпортувати не вдалося!

source: All of options will return to default settings. Are you sure you want to reset all settings?
ar: سيتم إرجاع القيم البدئية لجميع الإعدادات، هل أنت متأكد من هذه العملية ؟

source: Show Advanced Options
ar: إظهار الخيارات المتقدمة
it_it: Mostra opzioni avanzate
uk: Показати розширені опції

source: Hide Advanced Options
ar: إخفاء الخيارات المتقدمة
it_it: Nascondi opzioni avanzate
uk: Сховати розширені опції

source: Support this plugin!
ar: ادعم هذه الإضافة!
it_it: Sostieni questo plugin!
uk: Підтримайте цей плаґін!

source: Display "Page optimized by WP Minify" link in the footer
ar: إظهار رابط "هذه الصفحة تستخدم WP Minify" أسفل صفحات الموقع
it_it: Mostra nel footer il link "Ottimizzazione pagina via WP Minify"
uk: Показувати в підвалі «Page optimized by WP Minify»

source: Do not display "Page optimized by WP Minify" link.
ar: إخفاء رابط "هذه الصفحة تستخدم WP Minify".
it_it: Non mostrare il link "Ottimizzazione pagina via WP Minify".
uk: Не показувати «Page optimized by WP Minify»

source: General Configuration
ar: إعدادات عامة
it_it: Configurazione generale
uk: Загальні опції

source: Enable JavaScript Minification
ar: تفعيل ضغط الـ JavaScript
it_it: Attiva minimizzazione per i JavaScript
uk: Включити мінімізацію JavaScript

source: Enable CSS Minification
ar: تفعيل ضغط الـ CSS
it_it: Attiva minimizzazione CSS
uk: Включити мінімізацію CSS

source: Enable HTML Minification
ar: تفعيل ضغط الـ HTML
it_it: Attiva minimizzazione HTML
uk: Включити мінімізацію HTML

source: Debugging
ar: تصحيح الأخطاء
uk: Режим відлагодження

source: Combine files but do not minify
ar: جمع الملفات دون ضغطها
it_it: Unire i file senza minimizzarli
uk: Об’єднати файли, але не мінімізувати

source: Show minify errors through FirePHP
ar: إظهار أخطاء الضغط عبر FirePHP
it_it: Mostra errori minimizzazione via FirePHP
uk: Показувати помилки мінімізації у FirePHP

source: Local Files Minification
ar: ضغظ الملفات المحلية
it_it: Minimizzazione file locali
uk: Мінімізація локальних файлів

source: JavaScript files to exclude from minify (line delimited).
ar: ملفات الـ JavaScript المراد استثناءها من الضغط (رابط بكل سطر).
it_it: File JavaScript da escludere dalla minimizzazione (uno per riga).
uk: Файли Javascript для виключення (у кожному рядку по файлу).

source: CSS files to exclude from minify (line delimited).
ar: ملفات الـ CSS المراد استثناءها من الضغط (رابط بكل سطر).
it_it: File CSS da escludere dalla minimizzazione (uno per riga).
uk: CSS файли для виключення (у кожному рядку по файлу).

source: URIs on which WP-Minify-Fix parsing will be disabled (line delimited)
ar: الروابط التي سيتم فيها تعطيل خاصية WP-Minify-Fix Parsing (رابط بكل سطر)

source: Non-Local Files Minification
ar: ضغط الملفات الغير محلية
it_it: Minimizzazione file non locali
uk: Мінімізація НЕ локальних файлів

source: Enable minification on external files
ar: تفعيل ضغط الملفات الخارجية
it_it: Attiva minimizzazione per i file esterni
uk: Включити мінімізацію сторонніх файлів

source: Not recommended unless you want to exclude a bunch of external .js/.css files
ar: لا يُنصح به إلا إذا كنت تريد استثناء بعض ملفات CSS/JS الخارجية.
it_it: Non consigliabile a patto che tu non voglia escludere un gruppo di file .js/.css esterni
uk: Не рекомендується, якщо ви хочете виключити купу зовнішніх .js /.css файлів

source: External JavaScript files to include into minify.
ar: ملفات الـ JavaScript الخارجية ليتم إضافتها إلى محرك الضغط.
it_it: File JavaScript esterni da includere alla minimizzazione.
uk: Сторонні файли JavaScript для включення в мінімізацію.

source: Only useful if "Minification on external files" is unchecked
ar: هذا الخيار يعمل فقط إذا كانت
it_it: Utile solo se "Minimizzazione file esterni" non attiva
uk: Має сенс тільки тоді, коли «Включити мінімізацію сторонніх файлів» НЕ увімкнено

source: more info
ar: المزيد من المعلومات
it_it: ulteriori informazioni
uk: більше інформації

source: External CSS files to include into minify.
ar: الملفات الـ CSS الخارجية المراد ضغطها
it_it: File CSS esterni da includere alla minimizzazione.
uk: Зовнішні CSS-файли, які будуть включені в мінімізацію.

source: Caching
ar: التخزين
it_it: Cache
uk: Кешування

source: Cache expires after every
ar: انتهاء عمر النسخة المخزنة بعد
it_it: La cache scade ogni
uk: Видаляти кеш кожні

source: seconds
ar: ثانية
it_it: secondi
uk: секунд

source: Manually Clear Cache
ar: حذف النسخة المخزنة يدويا
it_it: Svuota manualmente la cache
uk: Очистити кеш вручну

source: JavaScript Placement
ar: موقع الـ JavaScript

source: In the header, and if necessary also in the footer (recommended)
ar: في الترويسة، وأيضا في الذيل إذا كان ضروريا (يُنصح به)

source: Everything in the header
ar: كل شيء في الترويسة (أعلى الصفحة)

source: Everything in the footer
ar: كل شيء في الذيل (أسفل الصفحة).

source: Use "pretty" URL"
ar: استعمال الرابط "اللطيف"
it_it: Usa "pretty" URL"

source: i.e. use "wp-minify-fix/cache/1234abcd.js" instead of "wp-minify-fix/min/?f=file1.js,file2.js,...,fileN.js"
ar: مثال: استخدم "wp-minify-fix/cache/1234abcd.js" instead of "wp-minify-fix/min/?f=file1.js,file2.js,...,fileN.js"

source: Add the HTML5 async tag
ar: إضافة وسم async الخاص بالـ HTML5

source: Only for the header
ar: فقط في الترويسة

source: Force all JavaScript/CSS calls to be HTTPS on HTTPS pages
ar: فرض الاتصال الآمن لجميع طلبات الـ JavaScript/CSS في الصفحات ذات الاتصال الآمن HTTPS.
it_it: Imponi a tutte le chiamate JavaScript/CSS di essere HTTPS per le pagine HTTPS

source: Automatically set your Minify base per siteurl setting (recommended)
ar: الرابط الرئيسية لمحرط الضغط Minify، يختلف حسب رابط موقع
it_it: Imposta in automatico Minify a url del sito (consigliato)

source: Extra arguments to pass to minify engine. This value will get append to calls to URL "wp-minify-fix/min/?f=file1.js,file2.js,...,fileN.js".
ar: إعدادات إضافية ليتم تمريرها إلى محرك الضغط، القيمة المدخلة سيتم إضافتها إلى الرابط "wp-minify-fix/min/?f=file1.js,file2.js,...,fileN.js".

source: e.g. You can specify this value to be b=somepath to specify the base path for all files passed into Minify.
ar: مثال: يُمكنك تحديد هذه القيمة عبر (b=عنوان-المجلد) لتحديد العنوان الرئيسي لجميع الملفات المراد ضغطها.
it_it: ad es: specifica il valore b=somepath per definire il percorso di base per tutti i file veicolati in Minify.

source: Update Options
ar: تحديث الإعدادات
it_it: Aggiorna le opzioni
uk: Оновити опції

source: Reset ALL Options
ar: تصفير جميع الإعدادات
it_it: Ripristina TUTTE le opzioni
uk: Скинути ВСІ опції

source: Cache directory is not writable. Please grant your server write permissions to the directory
ar: مجلد التخزين على الخادم ليس قابل للكتابة، رجاء تأكد من منح الخادم تصريح الكتابة للمجلد.
it_it: La cartella Cache non é scrivibile. Apporta le modifiche ai permessi chmod del file
uk: Директорія кешу не має прав на запис. Поставте права на запис.

source: Minify Engine config.php is not writable. Please grant your server write permissions to file
ar: ملف إعدادت محرك Minify (config.php) غير قابل للكتابة، تأكد من منح الخادم تصريح الكتابة للملف.
it_it: Il Minify Engine config.php non é scrivibile. Apporta le modifiche ai permessi chmod del file
uk: Файл налаштувань config.php не має прав на запис. Будь ласка, надайте права на запис

source: Some option settings are missing (possibly from plugin upgrade).
ar: بعض الإعدادات مفقودة (يُحتمل بسبب تحديث الإضافة).
it_it: Mancano alcune opzioni di impostazione (causa aggiornamento plugin).
uk: Деякі параметри налаштування відсутні (можливо, через оновлення плаґіну).

source: Minify Engine config.php was configured automatically.
ar: تم إعداد ملف إعداد محرك الضغط config.php تلقائيا.
it_it: Il Minify Engine config.php é stato configurato automaticamente.
uk: Файл config.php налаштовано автоматично.

source: WP Minify Options
ar: إعدادات WP Minify
it_it: Opzioni WP Minify
uk: Опції WP Minify

source: Documentation
ar: التوثيق
it_it: Documentazione
uk: Документація

source: Error: Could not fetch and cache URL
ar: خطأ: لم يتم تحميل وضغط الرابط.
it_it: Errore: impossibile elaborazione e cache URL
uk: Помилка: не вдалося отримати і закешувати URL

source: You might need to exclude this file in WP Minify options.
ar: ربما تحتاج إلى استثناء هذا الملف من خلال إعدادات WP Minify.
it_it: Potrebbe essere necessario escludere questo file nelle opzioni WP Minify.
uk: Вам може знадобитися виключити цей файл в опціях WP Minify.

source: [Fixed] This plugin uses the Minify engine to combine and compress JS and CSS files to improve page load time.
ar: [مُعدّل] هذه الإضافة تستعمل محرك الضغط Minify من أجل تجميع وضغط ملفات JS و CSS من أجل تحسين وقت تحميل الموقع.

source: All of options will return to default settings. Are you sure you want to reset all settings?
it_it: Tutte le opzioni ritorneranno alla impostazioni predefinite. Sei certo di volere procedere?
uk: Усі налаштування буде видалено. Ви справді хочете повернутися до стандартних налаштувань?

source: I will donate and/or write about this plugin
it_it: Ho scritto e/o donato per questo plugin
uk: Я хочу зробити благодійний внесок чи написати про плаґін

source: URIs on which WP-Minify parsing will be disabled (line delimited)
it_it: URI da escludere dal parsing di WP-Minify (uno per riga)
uk: Адреси URI, на яких WP-Minify буде відключено (у кожному рядку по файлу)

source: i.e. use "wp-minify/cache/1234abcd.js" instead of "wp-minify/min/?f=file1.js,file2.js,...,fileN.js"
it_it: ad esempio usa "wp-minify/cache/1234abcd.js" al posto di "wp-minify/min/?f=file1.js,file2.js,...,fileN.js"

source: Place Minified JavaScript in footer
it_it: Posiziona il Minified JavaScript nel footer
uk: Розмістити мінімізовані файли JavaScript у підвалі

source: Not recommended
it_it: Non consigliato
uk: Не рекомендовано

source: Extra arguments to pass to minify engine. This value will get append to calls to URL "wp-minify/min/?f=file1.js,file2.js,...,fileN.js".
it_it: Argomenti extra da veicolare nel motore di minimizzazione. Questo valore verrà aggiunto alle chiamate all'URL "wp-minify/min/?f=file1.js,file2.js,...,fileN.js".

source: Don't use "pretty" URL"
uk: Не використовувати «гарні» URL

source: Tweaking/Tuning
uk: Тонка настройка/Тюнінґ
